Catalogs/Транспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Транспорт</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеСудна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвиарейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Транспорт/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ТипТС = Справочники.ТипыТранспортныхСредств.Автомобильный Тогда
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			НаименованиеСтрока = НомерАвтомобиля + " " + НомерПП + " " + НомерКонтейнера  + " " + ТипТС.Наименование;
			Наименование = СокрЛП(НаименованиеСтрока);
		КонецЕсли;
		
		НомерАвиарейса = "";
		НомерВагона = "";
		НазваниеСудна = "";
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.Авиатранспортный Тогда
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			НаименованиеСтрока = НомерАвиарейса + " " + ТипТС.Наименование;
			Наименование = СокрЛП(НаименованиеСтрока);
		КонецЕсли;
		
		НомерАвтомобиля = "";
		НомерПП = "";
		НомерКонтейнера = "";
		НомерВагона = "";
		НазваниеСудна = "";
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.Железнодорожный Тогда
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			НаименованиеСтрока = НомерВагона + " " + ТипТС.Наименование;
			Наименование = СокрЛП(НаименованиеСтрока);
		КонецЕсли;
		
		НомерАвиарейса = "";
		НомерАвтомобиля = "";
		НомерПП = "";
		НомерКонтейнера = "";
		НазваниеСудна = "";
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.МорскойКонтейнер
		Или ТипТС = Справочники.ТипыТранспортныхСредств.МорскойТрюм
		Или ТипТС = Справочники.ТипыТранспортныхСредств.Речной Тогда
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			НаименованиеСтрока = НазваниеСудна + " " + ТипТС.Наименование;
			Наименование = СокрЛП(НаименованиеСтрока);
		КонецЕсли;
		
		НомерАвиарейса = "";
		НомерАвтомобиля = "";
		НомерПП = "";
		НомерКонтейнера = "";
		НомерВагона = "";
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.Перегон Тогда
		
		Наименование = ТипТС.Наименование;
		
		НомерАвиарейса = "";
		НомерАвтомобиля = "";
		НомерПП = "";
		НомерКонтейнера = "";
		НомерВагона = "";
		НазваниеСудна = "";
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипТС = Справочники.ТипыТранспортныхСредств.Автомобильный Тогда
		ПроверяемыеРеквизиты.Добавить("НомерАвтомобиля");
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.Авиатранспортный Тогда
		ПроверяемыеРеквизиты.Добавить("НомерАвиарейса");
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.Железнодорожный Тогда
		ПроверяемыеРеквизиты.Добавить("НомерВагона");
	ИначеЕсли ТипТС = Справочники.ТипыТранспортныхСредств.МорскойКонтейнер
		ИЛИ ТипТС = Справочники.ТипыТранспортныхСредств.МорскойТрюм
		ИЛИ ТипТС = Справочники.ТипыТранспортныхСредств.Речной Тогда
		ПроверяемыеРеквизиты.Добавить("НазваниеСудна");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
